renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
/*
* Copyright (C) 2021-2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/**********************************************************************************************************************
 * File Name    : r_flash_nofcu.c
 * Description  : This module implements functions common to Flash Types 1.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *           23.04.2021 4.80    First Release. (Changed the structure of FLASH_TYPE_1 code with the addition of RX140.)
 *           12.12.2021 4.81    Modified some global variables problems.
 *           10.12.2021 4.81    Added support for Tool News R20TS0772, and removed unnecessary code in flash_write().
 *           24.01.2023 5.00    Modified the condition of PFRAM section definition.
 *           01.10.2023 5.11    Added support for Tool News R20TS0963.
 *           15.11.2024 5.21    Added WAIT_LOOP comment.
 *           20.03.2025 5.22    Changed the disclaimer in program sources
*********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_flash_rx_if.h"

#ifndef FLASH_HAS_FCU
#include "r_flash_nofcu.h"
#include "r_flash_group.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Private global variables and functions
 *********************************************************************************************************************/
#ifndef FLASH_NO_DATA_FLASH
static void flash_df_pe_mode_enter(void);
static void flash_df_read_mode_enter(void);
static void flash_df_erase(const uint32_t start_addr, const uint32_t num_blocks);
static void flash_df_blankcheck(const uint32_t start_addr, const uint32_t end_addr);
static void flash_df_write(const uint32_t src_addr, const uint32_t dest_addr);
#endif

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
static void flash_cf_pe_mode_enter(void);
static void flash_cf_read_mode_enter(void);
static void flash_cf_erase(const uint32_t start_addr, const uint32_t num_blocks);
static void flash_cf_blankcheck(const uint32_t start_addr, const uint32_t end_addr);
static void flash_cf_write(const uint32_t src_addr,  const uint32_t dest_addr);
#endif

static void flash_write_fpmcr (uint8_t value);
static flash_err_t flash_wait_frdy(void);

#ifndef FLASH_NO_DATA_FLASH
/**********************************************************************************************************************
 * Function Name: flash_df_access_enable
 * Description  : Enable the E2 Data Flash Access and wait for the DataFlash STOP recovery time
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void flash_df_access_enable(void)
{
    /* E2 DataFlash Access enable */
    FLASH.DFLCTL.BIT.DFLEN = 1;

    if(1 == FLASH.DFLCTL.BIT.DFLEN)
    {
        R_BSP_NOP();
    }

    /* Wait for 5us over (tDSTOP) */
    flash_delay_us(WAIT_TDSTOP, ICLK_KHZ);
}

/**********************************************************************************************************************
 * Function Name: flash_df_pe_mode_enter
 * Description  : Executes the sequence to enter P/E mode.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
static void flash_df_pe_mode_enter(void)
{
    FLASH.FENTRYR.WORD = FENTRYR_DATAFLASH_PE_MODE;

    /* Wait for 5us over (tDSTOP) */
    flash_delay_us(WAIT_TDSTOP, ICLK_KHZ);

#if (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    flash_write_fpmcr(DATAFLASH_PE_MODE);

    FLASH.FISR.BIT.PCKA = (FLASH_FISR_FCLK_FREQ < MCU_CFG_FCLK_HZ) ? 
        (FCLK_MHZ - (((FCLK_MHZ - (FLASH_FISR_FCLK_FREQ / MHZ)) / 2)) - 1) : FCLK_MHZ - 1;
#else
    if (OPCCR_HIGH_SPEED_MODE == SYSTEM.OPCCR.BIT.OPCM)
    {
        flash_write_fpmcr(DATAFLASH_PE_MODE);
    }
    else
    {
        flash_write_fpmcr(DATAFLASH_PE_MODE | LVPE_MODE);
    }

    FLASH.FISR.BIT.PCKA = FCLK_MHZ - 1;
#endif
}

/**********************************************************************************************************************
 * Function Name: flash_df_read_mode_enter
 * Description  : Executes the sequence to enter read mode.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
static void flash_df_read_mode_enter(void)
{
    flash_write_fpmcr(READ_MODE);

    /* Wait for 5us over (tMS) */
    flash_delay_us(WAIT_TMS_HIGH, ICLK_KHZ);

    FLASH.FENTRYR.WORD = FENTRYR_READ_MODE;

    /* WAIT_LOOP */
    while (0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Confirm that the written value can be read correctly. */
    }
}

/**********************************************************************************************************************
 * Function Name: flash_df_erase
 * Description  : Performs block erasing between specified addresses. Address validation
 *                has already been performed by the caller.
 * Arguments    : start_addr   : Start address for erasing
 *              : num_blocks   : # of blocks to erase
 * Return Value : None
 *********************************************************************************************************************/
static void flash_df_erase(const uint32_t start_addr, const uint32_t num_blocks)
{
    uint32_t block_start_addr;
    uint32_t block_end_addr;

