renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
    block_start_addr = start_addr - DATAFLASH_ADDR_OFFSET;  /* Conversion to the P/E address from the read address */
    block_end_addr   = ((start_addr + (num_blocks * FLASH_DF_BLOCK_SIZE)) - DATAFLASH_ADDR_OFFSET) - 1;

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* Erase start address setting */
    FLASH.FSARH = (uint16_t)(block_start_addr >> 16);
    FLASH.FSARL = (uint16_t)(block_start_addr & 0xFFFF);

    /* Erase end address setting */
    FLASH.FEARH = (uint16_t)(block_end_addr >> 16);
    FLASH.FEARL = (uint16_t)(block_end_addr & 0xFFFF);
#else
    /* Erase start address setting */
    FLASH.FSARH = (uint8_t)((block_start_addr >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(block_start_addr & 0xFFFF);

    /* Erase end address setting */
    FLASH.FEARH = (uint8_t)((block_end_addr >> 16) & 0x0F);
    FLASH.FEARL = (uint16_t)(block_end_addr & 0xFFFF);
#endif

    /* Execute Erase command */
    FLASH.FCR.BYTE = FCR_ERASE;
}

/**********************************************************************************************************************
 * Function Name: flash_df_blankcheck
 * Description  : Performs blank check for the area between specified addresses.
 * Arguments    : start_addr   : Start address for blank check
 *              : end_addr     : End address for blank check
 * Return Value : FLASH_SUCCESS     - The checked addresses are all blank
 *              : FLASH_ERR_FAILURE - Blank check error
 *********************************************************************************************************************/
static void flash_df_blankcheck(const uint32_t start_addr, const uint32_t end_addr)
{
    uint32_t start_addr_idx;
    uint32_t end_addr_idx;

    start_addr_idx = start_addr - DATAFLASH_ADDR_OFFSET;  /* Conversion to the P/E address from the read address */
    end_addr_idx   = end_addr - DATAFLASH_ADDR_OFFSET;    /* Conversion to the P/E address from the read address */

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* BlankCheck start address setting */
    FLASH.FSARH = (uint16_t)(start_addr_idx >> 16);
    FLASH.FSARL = (uint16_t)(start_addr_idx & 0xFFFF);

    /* BlankCheck end address setting */
    FLASH.FEARH = (uint16_t)(end_addr_idx >> 16);
    FLASH.FEARL = (uint16_t)(end_addr_idx & 0xFFFF);
#else
    /* BlankCheck start address setting */
    FLASH.FSARH = (uint8_t)((start_addr_idx >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(start_addr_idx & 0xFFFF);

    /* BlankCheck end address setting */
    FLASH.FEARH = (uint8_t)((end_addr_idx >> 16) & 0x0F);
    FLASH.FEARL = (uint16_t)(end_addr_idx & 0xFFFF);
#endif

    /* Execute BlankCheck command */
    FLASH.FCR.BYTE = FCR_BLANKCHECK;
}

/**********************************************************************************************************************
 * Function Name: flash_df_write
 * Description  : Programs the specified data to the E2 Data Flash data.
 * Arguments    : block_start_addr   : Start address (read form) for erasing
 *              : block_end_addr     : End address (read form) for erasing
 * Return Value : None
 *********************************************************************************************************************/
static void flash_df_write(const uint32_t src_addr,  const uint32_t dest_addr)
{
    uint32_t dest_addr_idx;
    uint8_t  *write_data = (uint8_t *)src_addr;

    dest_addr_idx = dest_addr - DATAFLASH_ADDR_OFFSET;  /* Conversion to the P/E address from the read address */

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* Write start address setting */
    FLASH.FSARH = (uint16_t)(dest_addr_idx >> 16);
    FLASH.FSARL = (uint16_t)(dest_addr_idx & 0xFFFF);

    FLASH.FWB3 = (uint16_t)0x0000;
    FLASH.FWB2 = (uint16_t)0x0000;
    FLASH.FWB1 = (uint16_t)0x0000;
    FLASH.FWB0 = (uint16_t)(*write_data);
#else
    /* Write start address setting */
    FLASH.FSARH = (uint8_t)((dest_addr_idx >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(dest_addr_idx & 0xFFFF);

    /* Write data setting */
    FLASH.FWBH = (uint16_t)0x0000;
    FLASH.FWBL = (uint16_t)(*write_data);
#endif

    /* Execute Write command */
    FLASH.FCR.BYTE = FCR_WRITE;
}
#endif /* #ifndef FLASH_NO_DATA_FLASH */

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0)
/* All the functions below need to be placed in RAM if Code Flash programming is to be supported */
#define FLASH_PE_MODE_SECTION    R_BSP_ATTRIB_SECTION_CHANGE(P, FRAM)
#define FLASH_SECTION_CHANGE_END R_BSP_ATTRIB_SECTION_CHANGE_END
#else
#define FLASH_PE_MODE_SECTION
#define FLASH_SECTION_CHANGE_END
#endif

/**********************************************************************************************************************
 * Function Name: flash_get_status
 * Description  : Returns the current state of the flash
 *                NOTE1: This function does not have to execute from in RAM. It must be in RAM though if
 *                CF BGO is enabled and this function is called during a ROM P/E operation.
 * Arguments    : None
 * Return Value : FLASH_SUCCESS -
 *                    Flash is ready to use
 *                FLASH_ERR_BUSY -
 *                    Flash is busy with another operation or is uninitialized
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_get_status (void)
{

    /* Return flash status */
    if( g_flash_state == FLASH_READY )
    {
        return FLASH_SUCCESS;
    }
    else
    {
        return FLASH_ERR_BUSY;
    }
}

/**********************************************************************************************************************
 * Function Name: flash_reset
 * Description  : Function resets the Flash peripheral
 * Arguments    : None
 * Return Value : FLASH_SUCCESS -
 *                Flash circuit successfully reset.
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
void flash_reset() 
{
    /* Reset Flash */
    FLASH.FRESETR.BIT.FRESET = 1;
    FLASH.FRESETR.BIT.FRESET = 0;
}

/**********************************************************************************************************************
 * Function Name: flash_stop
 * Description  : Function issues the STOP command
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
void flash_stop(void)
{
    if ((g_current_parameters.bgo_enabled_cf == true)
     || (g_current_parameters.bgo_enabled_df == true))
    {
        /* Disable FRDYI interrupt request */
        flash_InterruptRequestDisable(VECT(FCU,FRDYI));
    }

    if ((FLASH.FENTRYR.WORD == 0x0080) || (FLASH.FENTRYR.WORD == 0x0001))
    {
        FLASH.FCR.BIT.STOP = 1;
        /* WAIT_LOOP */
        while (FLASH.FSTATR1.BIT.FRDY == 0)     // wait for FRDY
            ;

        FLASH.FCR.BYTE = 0;
        /* WAIT_LOOP */
        while (FLASH.FSTATR1.BIT.FRDY == 1)     // wait for FRDY
            ;
    }

    if ((g_current_parameters.bgo_enabled_cf == true)
     || (g_current_parameters.bgo_enabled_df == true))
    {
        /* Clear FRDYI interrupt request */
        IR(FCU,FRDYI) = 0;

        /* Exit program/erase mode */
        flash_pe_mode_exit();

        /* Release lock and Set current state to Idle */
        flash_release_state();
    }
}

/**********************************************************************************************************************
 * Function Name: flash_delay
 * Description  : Wait processing that loops at a fixed five cycles.
 * Arguments    : R1 : Waiting loop counter
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
R_BSP_PRAGMA_STATIC_INLINE_ASM(flash_delay)
void flash_delay(unsigned long loop_cnt)
{
    R_BSP_ASM_INTERNAL_USED(loop_cnt)
    R_BSP_ASM_BEGIN
    R_BSP_ASM(    BRA.B   R_BSP_ASM_LAB_NEXT(0)    )
    R_BSP_ASM(    NOP                              )
    R_BSP_ASM_LAB(0:                               )
    R_BSP_ASM(    NOP                              )
    R_BSP_ASM(    SUB     #01H, R1                 )
    R_BSP_ASM(    BNE.B   R_BSP_ASM_LAB_PREV(0)    )
    R_BSP_ASM_END
}

/**********************************************************************************************************************
 * Function Name: flash_delay_us
 * Description  : The number of loops is calculated based on the execution time (us)
 *              : and the sytem clock (ICLK) frequency, and the intrinsic function
 *              : that specifies the number of loops is called.
 * Arguments    : us  : Execution time
                : khz : ICLK frequency when calling the function
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
void flash_delay_us(unsigned long us, unsigned long khz)
{
    signed long loop_cnt; /* Argument of R_DELAY function */

    /* Calculation of a loop count */
    loop_cnt = us * khz;
    loop_cnt = (loop_cnt / WAIT_DIV_LOOP_CYCLE );      /* Division about cycle of 1 loop */
    loop_cnt = loop_cnt - WAIT_OVERHEAD_COUNT;         /* Overhead is reduced from a loop count. */

    /* R_DELAY function is performed when loop_cnt is 1 or more. */
    if(loop_cnt > 0)
    {
        flash_delay((unsigned long)loop_cnt);
    }
}

/**********************************************************************************************************************
 * Function Name: flash_pe_mode_enter
 * Description  : Function switches the peripheral to P/E mode for Code Flash or Data Flash.
 *              : And Flash Ready Interrupt enable (BGO mode)
 * Arguments    : flash_type_t : Specify Code Flash or Data Flash
 * Return Value : FLASH_SUCCESS -
 *                Switched successfully.
 *                FLASH_ERR_FAILURE -
 *                Unable to Switch to P/E Mode.
 *                FLASH_ERR_PARAM -
 *                Illegal parameter passed
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_pe_mode_enter(flash_type_t flash_type)
{
    flash_err_t err = FLASH_SUCCESS;

    if (flash_type == FLASH_TYPE_DATA_FLASH)
    {
#ifndef FLASH_NO_DATA_FLASH
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
        /* Enable Flash Ready Interrupt */
        IR(FCU,FRDYI) = 0;
        flash_InterruptRequestEnable(VECT(FCU,FRDYI));
#endif
        flash_df_pe_mode_enter();           /* Sets PCKA clock */
#endif
    }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    else if (flash_type == FLASH_TYPE_CODE_FLASH)
    {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
        /* Enable Flash Ready Interrupt */
        IR(FCU,FRDYI) = 0;
        flash_InterruptRequestEnable(VECT(FCU,FRDYI));
#endif
        flash_cf_pe_mode_enter();
    }
#endif
    else
    {
        err = FLASH_ERR_PARAM;
    }

