renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
    return err;
}

/**********************************************************************************************************************
 * Function Name: flash_pe_mode_exit
 * Description  : Exit PE mode to either DF or CF Read
 *              : And Flash Ready Interrupt disable (BGO mode)
 * Arguments    : None
 * Return Value : FLASH_SUCCESS -
 *                Switched successfully.
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_pe_mode_exit()
{
    if (FLASH.FENTRYR.WORD == 0x0080)
    {
#ifndef FLASH_NO_DATA_FLASH
        flash_df_read_mode_enter();
#endif
    }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    else if (FLASH.FENTRYR.WORD == 0x0001)
    {
        flash_cf_read_mode_enter();
    }
#endif

#if ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1) || (FLASH_CFG_DATA_FLASH_BGO == 1))
    /* Disable Flash Ready Interrupt */
    flash_InterruptRequestDisable(VECT(FCU,FRDYI));
#endif

    return(FLASH_SUCCESS);
}

/**********************************************************************************************************************
 * Function Name: flash_erase
 * Description  : Function erases a block of Code or Data Flash
 * Arguments    : uint32_t block address
 * Return Value : FLASH_SUCCESS -
 *                Block Erased successfully.
 *                FLASH_ERR_TIMEOUT
 *                Erase operation timed out.
 *                FLASH_ERR_FAILURE
 *                Erase operation failed for some other reason
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_erase(const uint32_t block_address, const uint32_t num_blocks)
{
    flash_err_t err = FLASH_SUCCESS;

    if (FLASH.FENTRYR.WORD == 0x0080)
    {
#ifndef FLASH_NO_DATA_FLASH
        flash_df_erase(block_address, num_blocks);
#endif
    }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    else if (FLASH.FENTRYR.WORD == 0x0001)
    {
        flash_cf_erase(block_address, num_blocks);
    }
#endif
    else
    {
        /* should never get here */
        return FLASH_ERR_FAILURE;
    }

    /* Return if in BGO mode. Processing will finish in FRDYI interrupt */
    if ((g_current_parameters.bgo_enabled_cf == true)
     || (g_current_parameters.bgo_enabled_df == true))
    {
        return err;
    }

    /* In blocking mode, wait for FRDY or timeout. Return if error. */
    err = flash_wait_frdy();
    if (err != FLASH_SUCCESS)
    {
        return err;
    }

    return err;
}

/**********************************************************************************************************************
 * Function Name: flash_blankcheck
 * Description  : Function checks if the specified Data Flash address range is blank
 * Arguments    : uint32_t address -
 *                 Start address to perform blank check. Actual address or entry from "flash_block_address_t" enum can be used
 *                uint32_t num_blocks -
 *                 Number of bytes to perform blank check operation for.
 *                flash_res_t *result
 *                 Returns the result of the blank check operation. This field is valid only in non-BGO mode
 *                  operation
 * Return Value : FLASH_ERR_TIMEOUT
 *                Operation timed out.
 *                FLASH_SUCCESS
 *                Operation started successfully (BGO/polling)
 *                Operation completed (Blocking)
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_blankcheck(const uint32_t start_address, const uint32_t num_bytes, flash_res_t *result)
{
    flash_err_t err = FLASH_SUCCESS;

    if (FLASH.FENTRYR.WORD == 0x0080)
    {
#ifndef FLASH_NO_DATA_FLASH
        flash_df_blankcheck(start_address, (start_address + num_bytes) - 1);
#endif
    }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    else if (FLASH.FENTRYR.WORD == 0x0001)
    {
        flash_cf_blankcheck(start_address, (start_address + num_bytes) - 1);
    }
#endif
    else
    {
        /* should never get here */
        return FLASH_ERR_FAILURE;
    }

    /* Return if in BGO mode. Processing will finish in FRDYI interrupt */
    if ((g_current_parameters.bgo_enabled_cf == true)
     || (g_current_parameters.bgo_enabled_df == true))
    {
        return err;
    }

    /* In blocking mode, wait for FRDY or timeout. Return if error. */
    err = flash_wait_frdy();
    if (FLASH_SUCCESS == err)
    {
        *result = FLASH_RES_BLANK;
    }
    else if (FLASH_ERR_FAILURE == err)
    {
        *result = FLASH_RES_NOT_BLANK;
        err = FLASH_SUCCESS;
    }
    else
    {
        /* timeout occurs */
    }

    return err;
}

/**********************************************************************************************************************
 * Function Name: flash_write
 * Description  : Function writes of Code or Data Flash
 * Arguments    : uint32_t src_address - the RAM area to take the data from
 *                uint32_t dest_address - the Flash address to write the data to
 *                uint32_t num - the count of bytes to write
 * Return Value : FLASH_SUCCESS -
 *                Block Erased successfully.
 *                FLASH_ERR_TIMEOUT
 *                Erase operation timed out.
 *                FLASH_ERR_FAILURE
 *                Erase operation failed for some other reason
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_write(const uint32_t src_address, const uint32_t dest_address, uint32_t num)
{
    flash_err_t err = FLASH_SUCCESS;

    g_current_parameters.src_addr = src_address;
    g_current_parameters.dest_addr = dest_address;

    if (FLASH.FENTRYR.WORD == 0x0080)
    {
#ifndef FLASH_NO_DATA_FLASH
        g_current_parameters.total_count = num / FLASH_DF_MIN_PGM_SIZE;
#endif
    }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    else if (FLASH.FENTRYR.WORD == 0x0001)
    {
        g_current_parameters.total_count = num / FLASH_CF_MIN_PGM_SIZE;
    }
#endif
    else
    {
        /* should never get here */
        return FLASH_ERR_FAILURE;
    }

    /* WAIT_LOOP */
    while(g_current_parameters.total_count > 0)
    {
        g_current_parameters.total_count--;

        /* Conversion to the P/E address from the read address */
        if (FLASH.FENTRYR.WORD == 0x0080)
        {
#ifndef FLASH_NO_DATA_FLASH
            flash_df_write(g_current_parameters.src_addr, g_current_parameters.dest_addr);
#endif
        }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
        else if (FLASH.FENTRYR.WORD == 0x0001)
        {
            flash_cf_write(g_current_parameters.src_addr, g_current_parameters.dest_addr);
        }
#endif

        /* Return if in BGO mode. Processing will finish in FRDYI interrupt */
        if ((g_current_parameters.bgo_enabled_cf == true)
         || (g_current_parameters.bgo_enabled_df == true))
        {
            break;
        }

        /* In blocking mode, wait for FRDY or timeout. Return if error. */
        err = flash_wait_frdy();
        if (err != FLASH_SUCCESS)
        {
            break;
        }

        /* timeout counter reset */
        if (FLASH.FENTRYR.WORD == 0x0080)
        {
#ifndef FLASH_NO_DATA_FLASH
            g_current_parameters.src_addr  += FLASH_DF_MIN_PGM_SIZE;
            g_current_parameters.dest_addr += FLASH_DF_MIN_PGM_SIZE;
            g_current_parameters.wait_cnt  =  WAIT_MAX_DF_WRITE;
#endif
        }
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
        else if (FLASH.FENTRYR.WORD == 0x0001)
        {
            g_current_parameters.src_addr  += FLASH_CF_MIN_PGM_SIZE;
            g_current_parameters.dest_addr += FLASH_CF_MIN_PGM_SIZE;
            g_current_parameters.wait_cnt  =  WAIT_MAX_ROM_WRITE;
        }
#endif
    }

