renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
    return err;
}

FLASH_SECTION_CHANGE_END /* end FLASH_SECTION_ROM */

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
/**********************************************************************************************************************
 * Function Name: flash_cf_pe_mode_enter
 * Description  : Executes the sequence to enter P/E mode.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_cf_pe_mode_enter(void)
{
    FLASH.FENTRYR.WORD = FENTRYR_CODEFLASH_PE_MODE;

#if (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    flash_write_fpmcr(CODEFLASH_PE_MODE);

    FLASH.FISR.BIT.PCKA = (FLASH_FISR_FCLK_FREQ < MCU_CFG_FCLK_HZ) ? 
        (FCLK_MHZ - (((FCLK_MHZ - (FLASH_FISR_FCLK_FREQ / MHZ)) / 2)) - 1) : FCLK_MHZ - 1;
#else
    flash_write_fpmcr(DISCHARGE_1);

    /* Wait for 2us over (tDIS) */
    flash_delay_us(WAIT_TDIS, ICLK_KHZ);

    if (OPCCR_HIGH_SPEED_MODE == SYSTEM.OPCCR.BIT.OPCM)
    {
        flash_write_fpmcr(DISCHARGE_2);
        flash_write_fpmcr(CODEFLASH_PE_MODE);

        /* Wait for 5us over (tMS) */
        flash_delay_us(WAIT_TMS_HIGH, ICLK_KHZ);
    }
    else
    {
        flash_write_fpmcr(DISCHARGE_2 | LVPE_MODE);
        flash_write_fpmcr(CODEFLASH_PE_MODE | LVPE_MODE);

        /* Wait for 3us over (tMS) */
        flash_delay_us(WAIT_TMS_MID, ICLK_KHZ);
    }

    FLASH.FISR.BIT.PCKA = FCLK_MHZ - 1;
#endif
}

/**********************************************************************************************************************
 * Function Name: flash_cf_read_mode_enter
 * Description  : Executes the sequence to enter read mode.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_cf_read_mode_enter(void)
{
#if (FLASH_TYPE_VARIETY != FLASH_TYPE_VARIETY_A)
    flash_write_fpmcr(DISCHARGE_2);

    /* Wait for 2us over (tDIS) */
    flash_delay_us(WAIT_TDIS, ICLK_KHZ);

    flash_write_fpmcr(DISCHARGE_1);
#endif

    flash_write_fpmcr(READ_MODE);

    /* Wait for 5us over (tMS) */
    flash_delay_us(WAIT_TMS_HIGH, ICLK_KHZ);

    FLASH.FENTRYR.WORD = FENTRYR_READ_MODE;

    /* WAIT_LOOP */
    while (0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Confirm that the written value can be read correctly. */
    }
}

/**********************************************************************************************************************
 * Function Name: flash_cf_erase
 * Description  : Performs block erasing between specified addresses.
 * Arguments    : start_addr   : Start address for erasing
 *              : num          : End address for erasing
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_cf_erase(const uint32_t start_addr, const uint32_t num_blocks)
{
    uint32_t block_start_addr;
    uint32_t block_end_addr;

    block_start_addr = start_addr - CODEFLASH_ADDR_OFFSET;  /* Conversion to the P/E address from the read address */
    block_end_addr   = ((start_addr + (num_blocks * FLASH_CF_BLOCK_SIZE)) - CODEFLASH_ADDR_OFFSET) - 1;

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* Erase start address setting */
    FLASH.FSARH = (uint16_t)(block_start_addr >> 16);
    FLASH.FSARL = (uint16_t)(block_start_addr & 0xFFF8);

    /* Erase end address setting */
    FLASH.FEARH = (uint16_t)(block_end_addr >> 16);
    FLASH.FEARL = (uint16_t)(block_end_addr & 0xFFF8);
#else
    /* Erase start address setting */
    FLASH.FSARH = (uint8_t)((block_start_addr >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(block_start_addr & 0xFFFC);

    /* Erase end address setting */
    FLASH.FEARH = (uint8_t)((block_end_addr >> 16) & 0x0F);
    FLASH.FEARL = (uint16_t)(block_end_addr & 0xFFFC);
#endif

    /* Execute Erase command */
    FLASH.FCR.BYTE = FCR_ERASE;
}

/**********************************************************************************************************************
 * Function Name: flash_cf_blankcheck
 * Description  : Performs blank check for the area between specified addresses.
 * Arguments    : start_addr   : Start address for blank check
 *              : end_addr     : End address for blank check
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_cf_blankcheck(const uint32_t start_addr, const uint32_t end_addr)
{
    uint32_t start_addr_idx;
    uint32_t end_addr_idx;

    start_addr_idx = start_addr - CODEFLASH_ADDR_OFFSET;    /* Conversion to the P/E address from the read address */
    end_addr_idx   = end_addr - CODEFLASH_ADDR_OFFSET;      /* Conversion to the P/E address from the read address */

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* BlankCheck start address setting */
    FLASH.FSARH = (uint16_t)(start_addr_idx >> 16);
    FLASH.FSARL = (uint16_t)(start_addr_idx & 0xFFF8);

    /* BlankCheck end address setting */
    FLASH.FEARH = (uint16_t)(end_addr_idx >> 16);
    FLASH.FEARL = (uint16_t)(end_addr_idx & 0xFFF8);
#else
    /* BlankCheck start address setting */
    FLASH.FSARH = (uint8_t)((start_addr_idx >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(start_addr_idx & 0xFFFC);

    /* BlankCheck end address setting */
    FLASH.FEARH = (uint8_t)((end_addr_idx >> 16) & 0x0F);
    FLASH.FEARL = (uint16_t)(end_addr_idx & 0xFFFC);
#endif

    /* Execute BlankCheck command */
    FLASH.FCR.BYTE = FCR_BLANKCHECK;
}

/**********************************************************************************************************************
 * Function Name: flash_cf_write
 * Description  : Programs the specified data to the Code Flash data.
 * Arguments    : block_start_addr   : Source address for data to be written
 *              : block_end_addr     : End address (read form) for writing
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_cf_write(const uint32_t src_addr, const uint32_t dest_addr)
{
    uint32_t dest_addr_idx;
    uint32_t *psrc_addr = (uint32_t *)src_addr;

    dest_addr_idx = dest_addr - CODEFLASH_ADDR_OFFSET;  /* Conversion to the P/E address from the read address */

    /* Select User Area */
    FLASH.FASR.BIT.EXS = 0;

#if defined(MCU_RX23_ALL) || defined(MCU_RX24_ALL) || (FLASH_TYPE_VARIETY == FLASH_TYPE_VARIETY_A)
    /* Write start address setting */
    FLASH.FSARH = (uint16_t)(dest_addr_idx >> 16);
    FLASH.FSARL = (uint16_t)(dest_addr_idx & 0xFFF8);

    FLASH.FWB0 = (uint16_t)(*psrc_addr & 0xFFFF);
    FLASH.FWB1 = (uint16_t)(*psrc_addr >> 16);

    psrc_addr ++;

    FLASH.FWB2 = (uint16_t)(*psrc_addr & 0xFFFF);
    FLASH.FWB3 = (uint16_t)(*psrc_addr >> 16);
#else
    /* Write start address setting */
    FLASH.FSARH = (uint8_t)((dest_addr_idx >> 16) & 0x0F);
    FLASH.FSARL = (uint16_t)(dest_addr_idx & 0xFFFC);

