renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
    /* Write data setting */
    FLASH.FWBH = (uint16_t)(*psrc_addr >> 16);
    FLASH.FWBL = (uint16_t)(*psrc_addr & 0xFFFF);
#endif

    /* Execute Write command */
    FLASH.FCR.BYTE = FCR_WRITE;
}

#endif /* (FLASH_CFG_CODE_FLASH_ENABLE == 1) */

/**********************************************************************************************************************
 * Function Name: flash_write_fpmcr
 * Description  : Specifies the argument set to the FPMCR register by the program sequence.
 * Arguments    : value     : Setting value for the FPMCR register
 * Return Value : None
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static void flash_write_fpmcr (uint8_t value)
{
    FLASH.FPR        = 0xA5;
    FLASH.FPMCR.BYTE = value;
    FLASH.FPMCR.BYTE = (uint8_t)~value;
    FLASH.FPMCR.BYTE = value;

    if(value == FLASH.FPMCR.BYTE)
    {
        R_BSP_NOP();
    }
}

/**********************************************************************************************************************
 * Function Name: flash_wait_frdy
 * Description  : Waits for the erase, blankcheck, and write command to be completed 
 *                and verifies the result of the command execution.
 * Arguments    : None.
 * Return Value : FLASH_SUCCESS     - Command executed successfully. (for blankcheck, the area is blank.)
 *                FLASH_ERR_TIMEOUT - Command timed out.
 *                FLASH_ERR_FAILURE - Command failed for some reason. (for blankcheck, the area is not blank.)
 *********************************************************************************************************************/
FLASH_PE_MODE_SECTION
static flash_err_t flash_wait_frdy(void)
{
    /* Check FREADY Flag bit*/
	/* WAIT_LOOP */
    while (1 != FLASH.FSTATR1.BIT.FRDY)
    {
        /* Check that execute command is completed. */
        /* Wait until FRDY is 0 unless timeout occurs. */
        g_current_parameters.wait_cnt--;

        if (g_current_parameters.wait_cnt <= 0)
        {
            /* if FRDY is not set to 1 after max timeout, return error*/
            return FLASH_ERR_TIMEOUT;
        }
    }

    /* Clear FCR register */
    FLASH.FCR.BYTE = FCR_CLEAR;

    /* WAIT_LOOP */
    while (0 != FLASH.FSTATR1.BIT.FRDY)
    {
        /* Check that execute command is completed. */
    }

    if ((0 != FLASH.FSTATR0.BIT.ILGLERR) || (0 != FLASH.FSTATR0.BIT.ERERR)
     || (0 != FLASH.FSTATR0.BIT.PRGERR)  || (0 != FLASH.FSTATR0.BIT.BCERR))
    {
        flash_reset();
        return FLASH_ERR_FAILURE;
    }

    return FLASH_SUCCESS;
}

#if ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1)) || (FLASH_CFG_DATA_FLASH_BGO == 1)
/**********************************************************************************************************************
 * Function Name: Excep_FCU_FRDYI
 * Description  : ISR that is called when FCU is done with flash operation
 *                NOTE: This function MUST execute from RAM only when
 *                      FLASH_CFG_CODE_FLASH_BGO is enabled.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(Excep_FCU_FRDYI,VECT(FCU,FRDYI))
FLASH_PE_MODE_SECTION
R_BSP_ATTRIB_STATIC_INTERRUPT void Excep_FCU_FRDYI(void)
{
    flash_err_t err = FLASH_SUCCESS;

#if ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1))

    if (FLASH_CUR_CF_BGO_ERASE  == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERASE_COMPLETE;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else if (FLASH_CUR_CF_BGO_WRITE  == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            if (g_current_parameters.total_count > 0)
            {
                g_current_parameters.src_addr  += FLASH_CF_MIN_PGM_SIZE;
                g_current_parameters.dest_addr += FLASH_CF_MIN_PGM_SIZE;
                g_current_parameters.wait_cnt  =  WAIT_MAX_ROM_WRITE;
                g_current_parameters.total_count--;

                flash_cf_write(g_current_parameters.src_addr, g_current_parameters.dest_addr);
            
                return; 
            }
            else
            {
                g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_WRITE_COMPLETE;
            }
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else if (FLASH_CUR_CF_BGO_BLANKCHECK == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_BLANK;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_NOT_BLANK;
        }
    }
    else if (FLASH_CUR_CF_ACCESSWINDOW == g_current_parameters.current_operation)
    {
        err = flash_wait_exrdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_SET_ACCESSWINDOW;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else if (FLASH_CUR_CF_TOGGLE_STARTUPAREA == g_current_parameters.current_operation)
    {
        err = flash_wait_exrdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_TOGGLE_STARTUPAREA;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else
    {
        /* Nothing to do */
    }
#endif  // #if ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1))


