renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_flash_rx/src/r_flash_nofcu.c
#ifndef FLASH_NO_DATA_FLASH
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
    if (FLASH_CUR_DF_BGO_ERASE == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERASE_COMPLETE;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else if (FLASH_CUR_DF_BGO_WRITE  == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            if (g_current_parameters.total_count > 0)
            {
                g_current_parameters.src_addr  += FLASH_DF_MIN_PGM_SIZE;
                g_current_parameters.dest_addr += FLASH_DF_MIN_PGM_SIZE;
                g_current_parameters.wait_cnt  =  WAIT_MAX_DF_WRITE;
                g_current_parameters.total_count--;

                flash_df_write(g_current_parameters.src_addr, g_current_parameters.dest_addr);
            
                return; 
            }
            else
            {
                g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_WRITE_COMPLETE;
            }
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
    else if (FLASH_CUR_DF_BGO_BLANKCHECK  == g_current_parameters.current_operation)
    {
        err = flash_wait_frdy();
        if (FLASH_SUCCESS == err)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_BLANK;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_NOT_BLANK;
        }
    }
    else
    {
        /* Nothing to do */
    }
#endif  // FLASH_CFG_DATA_FLASH_BGO
#endif  // #ifndef FLASH_NO_DATA_FLASH

    /* Release lock and Set current state to Idle */
    flash_pe_mode_exit();
    flash_release_state();
    g_current_parameters.current_operation = FLASH_CUR_IDLE;

    /* call back function execute */
    flash_ready_isr_handler((void *) &g_flash_int_ready_cb_args);
}

#endif  // ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1)) || (FLASH_CFG_DATA_FLASH_BGO == 1)

FLASH_SECTION_CHANGE_END /* end FLASH_SECTION_ROM */

#endif /* #ifndef FLASH_HAS_FCU */

/* end of file */
